#### WorksetConfiguration Members

---

|  |
| --- |
| WorksetConfiguration Class   Constructors   Methods   Properties   See Also |

The  WorksetConfiguration  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | WorksetConfiguration | Constructs a new workset configuration with an initial setting to open all user-created worksets. |
| Public method | WorksetConfiguration(WorksetConfiguration) | Constructs a new copy of the input WorksetConfiguration object. |
| Public method | WorksetConfiguration(WorksetConfigurationOption) | Constructs a new workset configuration with an initial setting to open or close all user-created worksets, or to open last viewed worksets. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Close | Sets a group of user-created worksets to close. |
| Public method | Dispose | Releases all resources used by the  WorksetConfiguration |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | Open | Sets a group of user-created worksets to open. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

WorksetConfiguration Class

Autodesk.Revit.DB Namespace